server1/loadtest.yml
config:
  target: "http://api.server1.net"
  plugins:
    expect: {}
  phases:
    - duration: 5
      arrivalRate: 5
      name: Warm up

scenarios:
  - name: "Signing and login"
    flow:
      - post:
          url: "/graphql"
          json:
            query: |
              mutation Signing($username: String!, $password: String!) {
                signing(username: $username, password: $password) {
                  username
                  access_token
                }
              }
            variables:
              username: "{{ $randomString() }}"
              password: "test"
          capture:
            json: "$.data.signing.username"
            as: "username"
          expect:
            - statusCode: 200
      - post:
          url: "/graphql"
          json:
            query: |
              mutation Login($username: String!, $password: String!) {
                login(username: $username, password: $password) {
                  username
                  access_token
                }
              }
            variables:
              username: "{{ username }}"
              password: "test"
          expect:
            - statusCode: 200